# Рабочая тетрадь №2 Григорьев Максим Эдуардович КРБО-01-21

# 1.3.1 Задание
### ***Создать 8x8 матрицу и заполнить её в шахматном порядке нулями и единицами.***

In [1]:
import numpy as np
A = np.tile(np.array([[1,0],[0,1]]), (4,4))
print(A)

[[1 0 1 0 1 0 1 0]
 [0 1 0 1 0 1 0 1]
 [1 0 1 0 1 0 1 0]
 [0 1 0 1 0 1 0 1]
 [1 0 1 0 1 0 1 0]
 [0 1 0 1 0 1 0 1]
 [1 0 1 0 1 0 1 0]
 [0 1 0 1 0 1 0 1]]

# 1.3.2 Задание
### ***Создать 5x5 матрицу со значениями в строках от 0 до 4. Для создания необходимо использовать функцию arrange.***

In [2]:
import numpy as np
x = np.zeros((5,5))
x += np.arange(5)
print(x)

[[0. 1. 2. 3. 4.]
 [0. 1. 2. 3. 4.]
 [0. 1. 2. 3. 4.]
 [0. 1. 2. 3. 4.]
 [0. 1. 2. 3. 4.]]

# 1.3.3 Задание
### ***Создать массив 3x3x3 со случайными значениями.***

In [3]:
import numpy as np
A = np.random.random((3,3,3))
print(A)

[[[0.04018602 0.31707324 0.80590019]
  [0.94080275 0.62142517 0.00213033]
  [0.16926959 0.60483131 0.10622338]]

 [[0.28167381 0.00516806 0.71196446]
  [0.87767498 0.30326302 0.76827043]
  [0.82834614 0.38603603 0.06817837]]

 [[0.55467279 0.27769611 0.1820021 ]
  [0.8142746  0.42692493 0.44615194]
  [0.74329737 0.53825201 0.35385737]]]

# 1.3.4 Задание
### ***Создать матрицу с 0 внутри, и 1 на границах.***

In [4]:
import numpy as np
A = np.ones((5,5))
A[1:-1,1:-1] = 0
print(A)

[[1. 1. 1. 1. 1.]
 [1. 0. 0. 0. 1.]
 [1. 0. 0. 0. 1.]
 [1. 0. 0. 0. 1.]
 [1. 1. 1. 1. 1.]]

# 1.3.5 Задание
### ***Создайте массив и отсортируйте его по убыванию.***

In [5]:
import numpy as np
A = np.random.random((6))
print(-np.sort(-A))

[0.75916034 0.66312385 0.59475694 0.58581748 0.36220696 0.01795307]

# 1.3.6 Задание
### ***Создайте матрицу, выведите ее форму, размер и размерность.***

In [6]:
import numpy as np
A = np.matrix(np.arange(1, 26).reshape((5, 5)))
print(A.shape, A.size, A.ndim)

(5, 5) 25 2

# Задание 2.3.1

### ***Найдитн евклидово расстояние между двумя Series (точками) a и b, не используя встроенную формулу.***

In [7]:
import pandas as pd 
import numpy as np

a = pd.Series(np.random.random(3))
b = pd.Series(np.random.random(3))
print(((b[0] - a[0])**2 + (b[1] - a[1])**2 + (b[2] - a[2])**2)**0.5)

0.6184576979168285

# 2.3.2 Задание
### ***Найдите в Интернете ссылку на любой csv файл и сформируйте из него фрейм данных.***

In [8]:
import pandas as pd 
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/sales.csv'
dataframe = pd.read_csv(url)
dataframe.head(5)

,Name,Country,Company,Date,Sales
0,Brenden Cote,Central African Republic,Metus Corp.,"Feb 17, 2018",67044
1,Justina Reed,Namibia,Lobortis Ltd,"Apr 27, 2017",89517
2,Daquan Vinson,Svalbard and Jan Mayen Islands,A Mi Consulting,"Aug 14, 2016",62705
3,Connor Shelton,Niue,Parturient Consulting,"Feb 13, 2017",12675
4,Drew Carlson,Mayotte,Interdum Associates,"Sep 26, 2017",86670

# 2.3.3 Задание

### ***Проделайте с получившемся из предыдущего задания фреймом данных те же действия, что и в примерах 2.2.5-2.2.7.***

In [9]:
dataframe.head(2)

           Name                   Country       Company          Date  Sales
0  Brenden Cote  Central African Republic   Metus Corp.  Feb 17, 2018  67044
1  Justina Reed                   Namibia  Lobortis Ltd  Apr 27, 2017  89517

In [10]:
dataframe.tail(3)

             Name      Country             Company          Date  Sales
97  Libby Lindsey        Qatar     Convallis Corp.   Nov 5, 2016  10583
98   Cody Langley  Isle of Man  Est Mollis Company   Oct 9, 2017  98167
99   Colt Schultz   Guadeloupe  Dolor Nonummy Inc.  Nov 18, 2017  39988

In [11]:
print(dataframe.shape)

(100, 5)

In [12]:
dataframe.iloc[2:6]

,Name,Country,Company,Date,Sales
2,Daquan Vinson,Svalbard and Jan Mayen Islands,A Mi Consulting,"Aug 14, 2016",62705
3,Connor Shelton,Niue,Parturient Consulting,"Feb 13, 2017",12675
4,Drew Carlson,Mayotte,Interdum Associates,"Sep 26, 2017",86670
5,Yoshio Curtis,Saint Martin,Ultrices Sit Amet Institute,"Apr 2, 2017",95955

In [13]:
dataframe[dataframe['Country'] == 'China'].head(2)

               Name Country                 Company          Date  Sales
22  Piper Daugherty   China              Eu Limited   Jun 7, 2016  56331
48      Farrah Ward   China  Cursus Et Eros Limited  Jul 31, 2016  77784

# Задание 3.3.2

### ***Загрузить фрейм данных по ссылке: https://raw.githubusercontent.com/akmand/datasets/master/iris.csv. Необходимо выполнить нормализацию первого числового признака (sepal_length_cm) с использованием минимаксного преобразования, а второго (sepal_width_cm) с задействованием z-масштабирования.***

In [14]:
from sklearn import preprocessing

url = 'https://raw.githubusercontent.com/akmand/datasets/master/iris.csv'
dataframe = pd.read_csv(url)

scaler1 = preprocessing.MinMaxScaler()
scaler2 = preprocessing.StandardScaler()
dataframe[['sepal_length_cm']] = scaler1.fit_transform(dataframe[['sepal_length_cm']])
dataframe[['sepal_width_cm']] = scaler2.fit_transform(dataframe[['sepal_width_cm']])

dataframe

,sepal_length_cm,sepal_width_cm,petal_length_cm,petal_width_cm,species
0,0.222222,1.032057,1.4,0.2,setosa
1,0.166667,-0.124958,1.4,0.2,setosa
2,0.111111,0.337848,1.3,0.2,setosa
3,0.083333,0.106445,1.5,0.2,setosa
4,0.194444,1.263460,1.4,0.2,setosa
...,...,...,...,...,...
145,0.666667,-0.124958,5.2,2.3,virginica
146,0.555556,-1.281972,5.0,1.9,virginica
147,0.611111,-0.124958,5.2,2.0,virginica
148,0.527778,0.800654,5.4,2.3,virginica
149,0.444444,-0.124958,5.1,1.8,virginica